app/Models/ModelHome.php

SELECT *
FROM `tbl_agenda`
WHERE month(tanggal) = '12'
AND year(tanggal) = '2023'
ORDER BY `tanggal` ASC
---
    public function Agenda()
    {
        return $this->db->table('tbl_agenda')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `tbl_kas_sosial`
WHERE `validasi` = 'ya'
---
    public function AllDataKasSosial()
    {
        return $this->db->table('tbl_kas_sosial')
        ->where('validasi','ya')
        ->get()->getResultArray();

INSERT INTO `tbl_donasi` (`id_rekening`, `nama_bank`, `no_rek`, `nama_pengirim`, `jumlah`, `jenis_donasi`, `bukti`, `tgl`) VALUES ('17', 'Bank BCA', '1111-3423-2454-5424', 'Dodo', '24543524', 'Masjid', '1704385918_a00dd69275ffbf368059.jpg', '2024-01-04')
---
    public function InsertDonasi($data)
    {
        $this->db->table('tbl_donasi')->insert($data);