app/Models/ModelKasSosial.php

SELECT *
FROM `tbl_kas_sosial`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_sosial')
            ->get()->getResultArray();

INSERT INTO `tbl_kas_sosial` (`tanggal`, `ket`, `kas_masuk`, `kas_keluar`, `validasi`, `status`) VALUES ('2024-01-04', 'Reval', '23423432', 0, 'tidak', 'Masuk')
---
    public function InsertData($data)
    {
        $this->db->table('tbl_kas_sosial')->insert($data);