app/Models/ModelKasMal.php

SELECT *
FROM `tbl_kas_zakatmal`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_zakatmal')
            ->get()->getResultArray();