app/Models/ModelAdmin.php

    public function ViewSetting()
    {
        return $this->db->table('tbl_setting')
            ->where('id', 1)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1

    public function AllDataKasMasjid()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '11'
AND year(tanggal) = '2023'

    public function AllDataKasZakatMal()
    {
        return $this->db->table('tbl_kas_zakatmal')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_zakatmal`
WHERE month(tanggal) = '11'
AND year(tanggal) = '2023'

    public function AllDataKasZakatPenghasilan()
    {
        return $this->db->table('tbl_kas_zakatpenghasilan')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_zakatpenghasilan`
WHERE month(tanggal) = '11'
AND year(tanggal) = '2023'

    public function AllDonasi()
    {
        return $this->db->table('tbl_donasi')
            ->join('tbl_rekening', 'tbl_rekening.id_rekening = tbl_donasi.id_rekening', 'left')
            ->select('tbl_donasi.no_rek as no_rek_pengirim')
            ->select('tbl_donasi.nama_bank as nama_bank_pengirim')
            ->select('tbl_donasi.nama_pengirim')
            ->select('tbl_donasi.jumlah')
            ->select('tbl_donasi.tgl')
            ->select('tbl_donasi.bukti')
            ->select('tbl_donasi.jenis_donasi')
            ->select('tbl_rekening.no_rek as no_rek_tujuan')

            ->orderBy('id_donasi', 'DESC')
            ->get()->getResultArray();
---
SELECT `tbl_donasi`.`no_rek` as `no_rek_pengirim`, `tbl_donasi`.`nama_bank` as `nama_bank_pengirim`, `tbl_donasi`.`nama_pengirim`, `tbl_donasi`.`jumlah`, `tbl_donasi`.`tgl`, `tbl_donasi`.`bukti`, `tbl_donasi`.`jenis_donasi`, `tbl_rekening`.`no_rek` as `no_rek_tujuan`
FROM `tbl_donasi`
LEFT JOIN `tbl_rekening` ON `tbl_rekening`.`id_rekening` = `tbl_donasi`.`id_rekening`
ORDER BY `id_donasi` DESC