app/Models/ModelKasMasjid.php

SELECT *
FROM `tbl_kas_masjid`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_masjid')
            ->get()->getResultArray();

SELECT *
FROM `tbl_kas_masjid`
WHERE `status` = 'Masuk'
---
    public function AllDataKasMasuk()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('status', 'Masuk')

INSERT INTO `tbl_kas_masjid` (`tanggal`, `ket`, `kas_masuk`, `kas_keluar`, `validasi`, `status`) VALUES ('2024-01-04', 'Dodo', '24543524', 0, 'tidak', 'Masuk')
---
    public function InsertData($data)
    {
        $this->db->table('tbl_kas_masjid')->insert($data);

SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '11'
AND year(tanggal) = '2023'
---
    public function AllDataBulanan($bulan, $tahun)
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('month(tanggal)', $bulan)
            ->where('year(tanggal)', $tahun)
            ->get()->getResultArray();