app/Models/ModelKasPenghasilan.php

    public function AllData()
    {
        return $this->db->table('tbl_kas_zakatpenghasilan')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_zakatpenghasilan`

    public function InsertData($data)
    {
        $this->db->table('tbl_kas_zakatpenghasilan')->insert($data);
---
INSERT INTO `tbl_kas_zakatpenghasilan` (`tanggal`, `ket`, `kas_masuk`, `kas_keluar`, `validasi`, `status`) VALUES ('2024-01-04', 'Cibo', '14324245', 0, 'tidak', 'Masuk')