app/Models/ModelRekening.php

    public function AllData()
{
    return $this->db->table('tbl_rekening')
        ->join('kode_rekening', 'kode_rekening.id = tbl_rekening.kode')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_rekening`
JOIN `kode_rekening` ON `kode_rekening`.`id` = `tbl_rekening`.`kode`

    public function getKode(){
        return $this->db->table('kode_rekening')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_rekening`